exemplo_chamada_soap.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tax="http://www.taxweb.com.br">
   <soapenv:Header/>
   <soapenv:Body>

	<tax:calcTaxes>
	<arg0>
	    <calcParam>
		<mdArred>A</mdArred>
		<geraInc>S</geraInc>
	    </calcParam>
	    <cdTipo>E</cdTipo>
	    <destinatario>
		<CDU2>Belém</CDU2>
		<CDU3>1</CDU3>
		<CDU4>1</CDU4>
		<CDU5>1</CDU5>
		<cdAtividadeEconomica>4789-0/99P</cdAtividadeEconomica>
		<cdMunicipio>1501402</cdMunicipio>
		<cdPais>105</cdPais>
		<cnpj>81559454000107</cnpj>
		<codigo>3022591327</codigo>
		<contribuinteCOFINS>S</contribuinteCOFINS>
		<contribuinteICMS>S</contribuinteICMS>
		<contribuinteII>N</contribuinteII>
		<contribuinteIPI>N</contribuinteIPI>
		<contribuinteISS>N</contribuinteISS>
		<contribuintePIS>S</contribuintePIS>
		<contribuinteST>N</contribuinteST>
		<pessoaJuridica>S</pessoaJuridica>
		<produtorRural>N</produtorRural>
		<uf>PA</uf>
	    </destinatario>
	    <docFiscalTeste>false</docFiscalTeste>
	    <dtES>2015-09-08T11:47:31-03:00</dtES>
	    <dtEmissao>2015-09-08T11:47:31-03:00</dtEmissao>
	    <dtPagto>2015-09-08T16:18:57-03:00</dtPagto>
	    <emitente>
		<CDU2>Guarulhos</CDU2>
		<CDU3>1</CDU3>
		<CDU4>1</CDU4>
		<CDU5>1</CDU5>
		<cdAtividadeEconomica>4693-1/00</cdAtividadeEconomica>
		<cdAtividadeEconomica>4789-0/99P</cdAtividadeEconomica>
		<cdMunicipio>3518800</cdMunicipio>
		<cdPais>105</cdPais>
		<cnpj>51632306000100</cnpj>
		<codigo>3022910032</codigo>
		<contribuinteCOFINS>S</contribuinteCOFINS>
		<contribuinteICMS>S</contribuinteICMS>
		<contribuinteII>N</contribuinteII>
		<contribuinteIPI>N</contribuinteIPI>
		<contribuinteISS>N</contribuinteISS>
		<contribuintePIS>S</contribuintePIS>
		<contribuinteST>N</contribuinteST>
		<nome>Dufry do Brasil Duty Free Shop LTDA.</nome>
		<pessoaJuridica>S</pessoaJuridica>
		<produtorRural>N</produtorRural>
		<uf>SP</uf>
	    </emitente>
	    <emitidoPorFornecedor>N</emitidoPorFornecedor>
	    <geraLog>N</geraLog>
	    <gravaHistorico>2</gravaHistorico>
	    <itensDocFiscal>
		<cdCSTCOFINS>98</cdCSTCOFINS>
		<cdCSTICMS>210</cdCSTICMS>
		<cdCSTPIS>98</cdCSTPIS>
		<cdCfop>6152</cdCfop>
		<cdClassificacao>M</cdClassificacao>
		<cdItemDocFiscal>784807</cdItemDocFiscal>
		<deduzCFOP>S</deduzCFOP>
		<deduzCSTCOFINS>S</deduzCSTCOFINS>
		<deduzCSTICMS>S</deduzCSTICMS>
		<deduzCSTPIS>S</deduzCSTPIS>
		<enquadramentos>
		    <dsSigla>COFINS</dsSigla>
		    <situacao>T</situacao>
		    <vlAliquota>0</vlAliquota>
		    <vlBase>0.0000</vlBase>
		    <vlImposto>0.0000</vlImposto>
		    <vlTributavel>0</vlTributavel>
		</enquadramentos>
		<enquadramentos>
		    <dsSigla>ICMS</dsSigla>
		    <situacao>T</situacao>
		    <vlAliquota>4</vlAliquota>
		    <vlBase>55.9800</vlBase>
		    <vlImposto>2.2400</vlImposto>
		    <vlTributavel>55.98</vlTributavel>
		</enquadramentos>
		<enquadramentos>
		    <dsSigla>PIS</dsSigla>
		    <situacao>T</situacao>
		    <vlAliquota>0</vlAliquota>
		    <vlBase>0.0000</vlBase>
		    <vlImposto>0.0000</vlImposto>
		    <vlTributavel>0</vlTributavel>
		</enquadramentos>
		<enquadramentos>
		    <dsSigla>ST</dsSigla>
		    <situacao>T</situacao>
		    <vlAliquota>0</vlAliquota>
		    <vlBase>0.0000</vlBase>
		    <vlImposto>0.0000</vlImposto>
		    <vlTributavel>0</vlTributavel>
		</enquadramentos>
		<enquadramentos>
		    <dsSigla>STE</dsSigla>
		    <situacao>T</situacao>
		    <vlAliquota>17</vlAliquota>
		    <vlBase>99.0700</vlBase>
		    <vlImposto>14.6000</vlImposto>
		    <vlTributavel>99.07</vlTributavel>
		</enquadramentos>
		<idItemDocFiscal>100070262</idItemDocFiscal>
		<prodItem>
		    <codigo>100070262</codigo>
		    <descricao>ABSOLUT BLUE 100CL</descricao>
		    <aplicacao>C</aplicacao>
		    <cdOrigem>2</cdOrigem>
		    <exNCM>113</exNCM>
		    <fabricacao>1</fabricacao>
		    <NCM>22086000</NCM>
		</prodItem>
		<qtItemDocFiscal>1</qtItemDocFiscal>
		<qtVolume>1000</qtVolume>
		<qtVolumeUnidade>ML</qtVolumeUnidade>
		<totalContemCOFINS>S</totalContemCOFINS>
		<totalContemIcms>S</totalContemIcms>
		<totalContemPIS>S</totalContemPIS>
		<unidade>EA</unidade>
		<vlDesconto>0.0000</vlDesconto>
		<vlFrete>0.0000</vlFrete>
		<vlTotal>55.9840</vlTotal>
		<vlUnitario>55.9840</vlUnitario>
	    </itensDocFiscal>
	    <modeloDeCustoParaTransferencias>UE</modeloDeCustoParaTransferencias>
	    <naturezaOperacao>014</naturezaOperacao>
	    <numero>13233</numero>
	    <qtPesoBruto>0</qtPesoBruto>
	    <serie>6</serie>
	    <tipoFrete>C</tipoFrete>
	    <tipoOperacao>I</tipoOperacao>
	    <tpCalculo>REC</tpCalculo>
	    <tpDocFiscal>FT</tpDocFiscal>
	    <vlFrete>0.0000</vlFrete>
	    <vlOda>0.0000</vlOda>
	    <vlSeguro>0.0000</vlSeguro>
	</arg0>
	</tax:calcTaxes>

   </soapenv:Body>
</soapenv:Envelope>
